In [2]:
import pandas as pd
import numpy as np

In [3]:
ar=np.array([0,1,2,3])
ar

array([0, 1, 2, 3])

In [4]:
ar1=np.array([0,1,None,3])

In [5]:
ar.mean()

1.5

In [6]:
ar1.mean()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [7]:
#Pour faire face à cela, nous utilisons désormais la fonction None:Not a Number de Numpy pour pouvoir aboutir au résultat de AR2
ar2=np.array([0,1,np.nan,3])

In [8]:
ar2

array([ 0.,  1., nan,  3.])

In [9]:
ar2.mean()

nan

In [11]:
"""Pour ne pas considérer justement l'élément None du tableau ar2"""
np.nanmean(ar2)

1.3333333333333333

In [13]:
#Exemple
ser2=pd.Series([np.nan,'Bonjour',2, None])

In [14]:
ser2

0        NaN
1    Bonjour
2          2
3       None
dtype: object

In [15]:
ser2 +ser2

0               NaN
1    BonjourBonjour
2                 4
3               NaN
dtype: object

In [16]:
# Fonctions pour connaitre les cellules qui posent un problème
ser2.isnull()

0     True
1    False
2    False
3     True
dtype: bool

In [17]:
ser2.notnull()

0    False
1     True
2     True
3    False
dtype: bool

In [19]:
#Fonctions pour éliminer les données manquantes 
ser2[ser2.notnull()]

1    Bonjour
2          2
dtype: object

In [21]:
ser2.dropna()

1    Bonjour
2          2
dtype: object

In [20]:
ser2[ser2.isnull()]

0     NaN
3    None
dtype: object

In [22]:
#Remplir les valeurs vides par une valeur donnée, par exemple ici, 0
ser2.fillna(0)

0          0
1    Bonjour
2          2
3          0
dtype: object

In [24]:
#Exemple avec un DataFrame
df1=pd.DataFrame([[1,np.nan,3],[4,5,6],[np.nan,8,9]])

In [25]:
df1

     0    1  2
0  1.0  NaN  3
1  4.0  5.0  6
2  NaN  8.0  9

In [28]:
df1.dropna()

     0    1  2
1  4.0  5.0  6

In [27]:
df1

     0    1  2
0  1.0  NaN  3
1  4.0  5.0  6
2  NaN  8.0  9

In [29]:
df1.dropna(axis=1)

   2
0  3
1  6
2  9

In [30]:
#Remplir les vleurs manquantes avec 0
df1.fillna(0)

     0    1  2
0  1.0  0.0  3
1  4.0  5.0  6
2  0.0  8.0  9

In [31]:
"""Il pourrait être utile mm de remplir les valeurs manquantes selon la colonne, chose qui est tout à fait possible en spécifiant
le nom de la colonne, chose qui est tout à fait possible en spécifiant le nom de la colonne ainsi que la valeur souhaitée 
en argument de la fonction fillna"""
df1.fillna({0:'Abs',1:99})

     0     1  2
0  1.0  99.0  3
1  4.0   5.0  6
2  Abs   8.0  9